# THIS FILE IS AUTOMATICALLY GENERATED
# Project: D:\GitHub\Alumnos\Sensores-actuadores\Clase_6\Ejemplo_1\NODO_1.cydsn\NODO_1.cyprj
# Date: Fri, 22 Nov 2024 23:58:18 GMT
#set_units -time ns
create_clock -name {CyXTAL_32kHz} -period 30517.578125 -waveform {0 15258.7890625} [list [get_pins {ClockBlock/clk_32k_xtal}]]
create_clock -name {CyXTAL} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/xtal}]]
create_clock -name {CyILO} -period 1000000 -waveform {0 500000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyIMO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyMASTER_CLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]


# Component constraints for D:\GitHub\Alumnos\Sensores-actuadores\Clase_6\Ejemplo_1\NODO_1.cydsn\TopDesign\TopDesign.cysch
# Project: D:\GitHub\Alumnos\Sensores-actuadores\Clase_6\Ejemplo_1\NODO_1.cydsn\NODO_1.cyprj
# Date: Fri, 22 Nov 2024 23:58:15 GMT
